; domain
(define (domain trickier_switches)
    (:requirements :typing :negative-preconditions :disjunctive-preconditions :conditional-effects)
    
    ;; this domain has one type of object
    (:types switch)

    (:predicates
        ;; the properties of a switch
        (off ?s - switch)
        (on ?s - switch)
        (neighbours ?s1 ?s2 - switch)
        (onedge ?s - switch)
    )
 

    ; this action toggles a switch ON
    ; a neighbouring switch must be already on!
    (:action switch_on
        :parameters (?s ?neighbour ?another - switch)
        :precondition (and
            (off ?s)
            (neighbours ?s ?neighbour)
            (on ?neighbour)
            (or
                (onedge ?s)
                (and (not (onedge ?s))
                    (neighbours ?s ?another)
                    (off ?another)
                )
            )
        )
        :effect (and
            (not (off ?s))
            (on ?s)
        )
    )
    
    ;; this action toggles a switch OFF
    (:action switch_off
        :parameters (?s - switch)
        :precondition (and
            (on ?s)
        )
        :effect (and
            (off ?s)
            (not (on ?s))
        )
    )
)

; problem
(define (problem more_switches)
(:domain trickier_switches)
    
    (:objects
        ;; switches
        switch_1  switch_2  switch_3 switch_4 switch_5 
        switch_6  switch_7  switch_8 switch_9 switch_10 - switch
    )
    
    (:init 
        (on switch_1)
        (off switch_2)
        (on switch_3)
        (off switch_4)
        (off switch_5)
        (on switch_6)
        (off switch_7)
        (off switch_8)
        (on switch_9)
        (off switch_10)
        (onedge switch_1)
        (onedge switch_10)

        (neighbours switch_1 switch_2)
        (neighbours switch_2 switch_1)
        (neighbours switch_2 switch_3)
        (neighbours switch_3 switch_2)
        (neighbours switch_3 switch_4)
        (neighbours switch_4 switch_3)
        (neighbours switch_4 switch_5)
        (neighbours switch_5 switch_4)
        (neighbours switch_5 switch_6)
        (neighbours switch_6 switch_5)
        (neighbours switch_6 switch_7)
        (neighbours switch_7 switch_6)
        (neighbours switch_7 switch_8)
        (neighbours switch_8 switch_7)
        (neighbours switch_8 switch_9)
        (neighbours switch_9 switch_8)
        (neighbours switch_9 switch_10)
        (neighbours switch_10 switch_9)
    )
    
    (:goal (and
        (on switch_1)
        (on switch_2)
        (on switch_3)
        (on switch_4)
        (on switch_5)
        (on switch_6)
        (on switch_7)
        (on switch_8)
        (on switch_9)
        (on switch_10)
    ))
)

; plan
1. (switch_on switch_10 switch_9 switch_10)
   deleted: (off switch_10)
   added: (on switch_10)
   goals met: 5 of 10
2. (switch_on switch_8 switch_9 switch_7)
   deleted: (off switch_8)
   added: (on switch_8)
   goals met: 6 of 10
3. (switch_on switch_4 switch_3 switch_5)
   deleted: (off switch_4)
   added: (on switch_4)
   goals met: 7 of 10
4. (switch_off switch_6)
   deleted: (on switch_6)
   added: (off switch_6)
   goals met: 6 of 10
5. (switch_on switch_5 switch_4 switch_6)
   deleted: (off switch_5)
   added: (on switch_5)
   goals met: 7 of 10
6. (switch_on switch_7 switch_8 switch_6)
   deleted: (off switch_7)
   added: (on switch_7)
   goals met: 8 of 10
7. (switch_off switch_1)
   deleted: (on switch_1)
   added: (off switch_1)
   goals met: 7 of 10
8. (switch_on switch_2 switch_3 switch_1)
   deleted: (off switch_2)
   added: (on switch_2)
   goals met: 8 of 10
9. (switch_on switch_1 switch_2 switch_10)
   deleted: (off switch_1)
   added: (on switch_1)
   goals met: 9 of 10
10. (switch_off switch_5)
   deleted: (on switch_5)
   added: (off switch_5)
   goals met: 8 of 10
11. (switch_on switch_6 switch_7 switch_5)
   deleted: (off switch_6)
   added: (on switch_6)
   goals met: 9 of 10
12. (switch_off switch_3)
   deleted: (on switch_3)
   added: (off switch_3)
   goals met: 8 of 10
13. (switch_off switch_4)
   deleted: (on switch_4)
   added: (off switch_4)
   goals met: 7 of 10
14. (switch_on switch_5 switch_6 switch_4)
   deleted: (off switch_5)
   added: (on switch_5)
   goals met: 8 of 10
15. (switch_on switch_4 switch_5 switch_3)
   deleted: (off switch_4)
   added: (on switch_4)
   goals met: 9 of 10
16. (switch_off switch_2)
   deleted: (on switch_2)
   added: (off switch_2)
   goals met: 8 of 10
17. (switch_on switch_3 switch_4 switch_2)
   deleted: (off switch_3)
   added: (on switch_3)
   goals met: 9 of 10
18. (switch_off switch_1)
   deleted: (on switch_1)
   added: (off switch_1)
   goals met: 8 of 10
19. (switch_on switch_2 switch_3 switch_1)
   deleted: (off switch_2)
   added: (on switch_2)
   goals met: 9 of 10
20. (switch_on switch_1 switch_2 switch_10)
   deleted: (off switch_1)
   added: (on switch_1)
   goals met: 10 of 10
